{"name": "distracted_boyfriend", "explanation": "This meme describes a situation where someone is ignoring their current commitment in favor of a more tempting alternative.", "schema": {"boyfriend": {"description": "Text describing the person who is tempted or distracted."}, "girlfriend": {"description": "Text describing the thing or responsibility that is supposed to hold the boyfriend's attention."}, "other_girl": {"description": "Text describing the tempting or attractive alternative that distracts the boyfriend."}}, "example": {"boyfriend": "me", "girlfriend": "finishing my work", "other_girl": "scrolling memes for 2 hours", "explanation": "I should be working, but memes are more tempting."}}
{"name": "bernie_once_again", "explanation": "This meme is used when you are repeatedly asking for the same thing or when someone keeps demanding the same request.", "schema": {"request": {"description": "Text describing the thing that is being asked for repeatedly."}}, "example": {"request": "your continued support in procrastinating", "explanation": "Joking about always needing excuses to avoid responsibilities."}}
{"name": "one_does_not_simply", "explanation": "This meme describes a situation where something is portrayed as impossible or extremely difficult to do in a casual manner.", "schema": {"task": {"description": "Text describing the supposedly impossible or hard-to-do task."}}, "example": {"task": "just eat one potato chip", "explanation": "Because stopping at only one chip is impossible."}}
{"name": "kermit_sipping_tea", "explanation": "This meme is used to point out something ironic, hypocritical, or amusing about someone else, usually with a sense of passive judgment or detachment.", "schema": {"observation": {"description": "Text describing the ironic, hypocritical, or amusing situation being commented on."}}, "example": {"observation": "People complaining about AI taking their jobs while using AI-generated content themselves", "explanation": "Because pointing out hypocrisy is fun, but it's not my problem."}}
